import flask

app = flask.Flask(__name__, template_folder="templates")

clans = [
    ("野兽人", ["卡扎克·独眼", "马拉戈·黑暗征兆", "魔古尔·影孽", "陶诺斯·铜牛"]),
    ("巴托尼亚", ["劳恩·列奥康沃尔", "艾博里克·德·波尔德罗", "湖神仙女", "赫潘丝·德·里昂尼斯"]),
    ("混沌矮人", ["阿斯特戈斯·铁手", "灰烬·德拉兹霍斯", "黑心·扎坦"]),
    ("混沌恶魔", ["恶魔亲王"]),
    ("黑暗精灵", ["马雷基斯", "莫拉丝", "妖婆赫莉本", "洛克西亚·堕落之心", "马鲁斯·黑刃", "拉卡斯"]),
    ("矮人", ["索尔葛林·负怨者", "阿格里姆·铁拳", "贝勒加·铁锤", "白矮人·格瑞姆布林戴尔", "托雷克·铁眉", "马拉凯·马凯森"]),
    ("帝国", ["皇帝·卡尔·弗兰茨", "拜尔沙泽·盖尔特", "马库斯·沃法特", "沃克玛·无情者", "埃斯佩斯·冯·邓肯"]),
    ("震旦天朝", ["飙龙·妙影", "镔龙·昭明", "玉龙·元伯"]),
    ("绿皮", ["格里姆格·铁皮", "阿兹汗·屠灭者", "史卡斯尼克", "乌尔扎戈·绿先知", "大肚王·咕噜"]),
    ("高等精灵", ["泰瑞昂", "泰格里斯", "艾拉瑞丽", "阿里斯·安纳尔", "艾萨里昂·无情者", "伊姆瑞克"]),
    ("恐虐", ["流放者·斯卡布兰德"]),
    ("基斯里夫", ["女沙皇卡捷琳", "康斯坦丁", "鲍里斯·厄孙", "奥斯坦基娅嬷嬷"]),
    ("蜥蜴人", ["领主·马兹达穆迪", "库·迦", "特亨霍因", "提克塔托", "哥罗克", "流放者·纳卡伊", "欧西约坦"]),
    ("诺斯卡", ["乌弗瑞克·流浪者", "索隆格"]),
    ("纳垢", ["库嘎斯·瘟父", "蛆虫之主·塔木尔可汗", "埃皮德穆斯"]),
    ("食人魔王国", ["格雷苏·大金牙", "斯卡拉格"]),
    ("斯卡文鼠人", ["奎克·猎头者", "领主·司库克", "崔特思·畏尾", "伊克特·利爪", "死亡大师·斯尼奇", "斯洛克·不洁者"]),
    ("色孽", ["纳卡里"]),
    ("古墓王", ["塞特拉", "卡特普", "至高女王卡莉达", "阿克汉"]),
    ("奸奇", ["卡洛斯·织命者", "变化灵"]),
    ("吸血鬼海岸", ["卢瑟·哈肯", "诺克特拉斯伯爵", "艾蕊娜萨·盐怨", "塞洛斯塔·恐怖之鳍"]),
    ("吸血鬼伯爵", ["曼弗雷德·冯·卡斯坦因", "海因里希·凯姆勒", "弗拉德·冯·卡斯坦因", "伊莎贝拉·冯·卡斯坦因", "赫尔曼·苟斯特"]),
    ("混沌勇士", ["艾查恩·永世神选", "柯烈克·食日者", "西格瓦尔德王子·美人", "阿扎泽尔", "水蛭领主·费斯图斯", "血腥·瓦尔基娅", "诅咒灵·维里奇", "比拉克"]),
    ("木精灵", ["奥莱恩", "杜尔苏", "暮光姐妹", "戴查"]),
]


@app.route("/")
def show_info():
    return flask.render_template("base.html")


@app.route("/zhongzu")
def show_zhongzu():
    return flask.render_template("zhongzu.html", clans=clans)


if __name__ == "__main__":
    app.run(debug=True)
